#1)  მომხმარებელს შემაოატაინეთ  რაიმე  რიცხვი და შემდეგ შეამოწმეთ ეგ რიცხვი ლუწია თუ კენტი თუ რიცხვი ლუწია დაუბეჭდეთ ლუწია და თუ კენტია დაუბეჭდეთ კენტია

num = int(input("Enter The Number: "))
if num % 2 == 0:
    print("luwia")

else:
    print("kentia")

#2) კომენტარების სახით ახსენით რაარის for ციკლი და რაში ვიყენებთ მას

#For ვიყენებთ მაშინ როდესაც ვიცით რამდენჯერ უნდა განმეორდეს კოდი 
#მას გამოვიყენებთ როდესაც გვინდა გადაუაროთ სიებს ან მასივებს და ამოვიღოთ ყველა მნიშვნელობა 

for i in range (10):
    print(i)

#4)  მომხმარებელს შეამოატაინეთ მისი ასაკი და შეამოწმეთ თუ მისი ასაკი მეტია 18 ზე დაუბეჭდეთ "you are adulet" სხვა შემთხვევაში დაუბეჭდეთ "you are teen" 

age = int(input("Enter Your Age: "))
if age > 18: 
    print("You are adult")

else:
    print("you are teen")


#5) მომხმარებელს შემოატაინეთ რიცხვი და შეამოწმეთ თუ რიცხვი მეტია 10 ზე დაუბეჭდეთ "რიცხვი მეტია 10 ზე"  თუ რიცხვი ტოლია 10 ის დაუბეჭდეთ "რიცხვი 10 ის ტოლია  და სხვაშემთხვევაში დაუბეჭდეთ რომ "რიცხვი ნაკლებია 10 ზე"

num = int(input("enter the num: "))
if num > 10:
    print("რიცხვი მეტია 10 ზე")
elif num == 10:
    print("რიცხვი ტოლია 10 ის")
else:
    print("რიცხვი ნაკლებია 10 ზე ")



