# hw2

# Custom ფუნქცია არის პროგრამისტის მიერ შექმნილი ფუნქცია
# მას ვიყენებთ იმისთვის, რომ კოდი:
# 1) იყოს უფრო გასაგები
# 2) თავიდან ავიცილოთ ერთი და იგივე კოდის გამეორება
# 3) მარტივად გამოვიყენოთ ერთი და იგივე ლოგიკა ბევრჯერ

# ფუნქციის შექმნის ეტაპები:
# 1) ვწერთ def საკვანძო სიტყვას
# 2) ვწერთ ფუნქციის სახელს
# 3) ფრჩხილებში ვუთითებთ პარამეტრებს (თუ საჭიროა)
# 4) ვწერთ ფუნქციის სხეულს (კოდი)
# 5) საჭიროების შემთხვევაში ვიყენებთ return-ს მნიშვნელობის დასაბრუნებლად

# პარამეტრები — ცვლადებია, რომლებსაც ვწერთ ფუნქციის შექმნის დროს
# არგუმენტები — რეალური მნიშვნელობებია, რომლებსაც ფუნქციის გამოძახებისას გადავცემთ


# hw3

def sum_numbers(a, b):
    return a + b
print(sum_numbers(5, 7))

# hw4

def check_even(number):
    if number % 2 == 0:
        print("რიცხვი ლუწია")
    else:
        print("რიცხვი კენტია")
check_even(10)


# hw5

def square_number(number):
    return number ** 2
print(square_number(4))

# hw6

def make_upper(text):
    return text.upper()
print(make_upper("hello world"))

# hw7

def full_name(name, surname):
    print("მომხმარებლის სახელია", name, "და გვარია", surname)

full_name("ზუკა", "გოგიძე")




