# 2) კომენტარებით ახსნა string ფუნქციებზე

# .upper() — ტექსტს აქცევს მთლიანად დიდ ასოებად


# .lower() — ტექსტს აქცევს მთლიანად პატარა ასოებად


# .capitalize() — მხოლოდ პირველ ასოს აქცევს დიდად,
# დანარჩენებს კი პატარა ასოებად


# .find() — ეძებს მითითებულ სიმბოლოს ან სიტყვას ტექსტში
# აბრუნებს მის ინდექსს
# თუ ვერ იპოვა — აბრუნებს -1



# 3) მომხმარებელს შემოატანინეთ წინადადება და დაბეჭდეთ პატარა ასოებით

sentence = input("შეიყვანეთ წინადადება: ")
print(sentence.lower())


# 4) მომხმარებელს შემოატანინეთ ელფოსტა და შეამოწმეთ შეიცავს თუ არა '@'-ს,
# შედეგი დაბეჭდეთ დიდი ასოებით

email = input("შეიყვანეთ ელფოსტის მისამართი: ")

result = "ელფოსტა შეიცავს @" if "@" in email else "ელფოსტა არ შეიცავს @"
print(result.upper())


# 5) მომხმარებელს შემოატანინეთ წიგნის დასახელება
# და დაბეჭდეთ სათაურის სტილში (Title Case)

book = input("შეიყვანეთ წიგნის დასახელება: ")
print(book.title())


# 6) მომხმარებელს შემოატანინეთ წინადადება და სიმბოლო
# დაითვალეთ რამდენჯერ გვხვდება ეს სიმბოლო წინადადებაში

text = input("შეიყვანეთ წინადადება: ")
symbol = input("შეიყვანეთ ერთი სიმბოლო: ")

count = text.count(symbol)
print(f"სიმბოლო '{symbol}' გვხვდება {count}-ჯერ")


# 7) მომხმარებელს შემოატანინეთ სიტყვა და შეამოწმეთ არის თუ არა დიდი ასოებით

word = input("შეიყვანეთ სიტყვა: ")

if word.isupper():
    print("სიტყვა უკვე დიდია!")
else:
    print(word.upper())


