# 1 კომენტარების სახით ახსენით თუ რაარის ფუნქცია და რაში გამოვიყენებთ მას

#ყველა ფუნქციას აქვს თავის რჩხილები სადაც გადავცემთ არგუმენტსც, გამოვიყენბთ იმისთვის რო კოდი იყოს გასაგები ასევე ფუნქციას აქვს სახელი, მას დრამდენჯერაც გვინდა გამოვიყენებთ

# 2 შექმენით ისეთი ფუნქცია რომელიც მიესალმება მომხმარებელს (მინიშნება უნდა გადასცეთ არგუმენტი

def greet(name):
    print("გამარჯობა", name)

greet("ზუკა")

# 3 შექმენით ისეთი ფუნქცია რომელიც დაუმატებს 1 რუცხვს მეორეს და დამწჭდავს საბოოლო ჯამს

def add_numbers(a, b):
    print(a + b)
add_numbers(5, 7)

# 4 კომენტარების სახლით ახსენით რაარის .upper .lower .capitalize და გააკეთეთ თითოზე თითო მაგალითი 

#upper ტექსტს აქცევს დიდ ასოებათ
text1 = "hello"
print(text1.upper())

#lower ტექსტ აქცევს პატარა ასოებათ
text2 = "HELLO"
print(text2.lower())

#capitalize ხდის მხოლოდ პირველ ასოს დიდს
text3 = "hello"
print(text3.capitalize())


# 5 კომენტარევის სახით ახსენით თუ რაარის f”” და რაში ვიყენებთ მას ასევე გააკეთეთ ერთი მაგალითი მაგის გამოყენებით

#f სტრინგგი არის ფორმატირებული სტრინგი მას ვიყენებთ ტექსტში ცვლადების მარტივად ჩასასმელად

name = "Zuka"
last_name = "Gogidze"
age = 16
print(f"ჩემი სახელია {name} {last_name} და ვარ {age} წლის")

