# 1) მომხმარებელს input-ის მეშვეობით შემოატანინეთ რაიმე წინადადება, თქვენი დავალებაა კი ეს წინადადება დაშალოთ ნაწილებად, კერძოდ კი იმ ნაწილებში სადაც შეხვდება space.

# 2) წინასწარ გაქვთ მოცემული შემდეგი სია: ['hi', 'hello', '84', '16']. მომხმარებელს შემოატანინეთ input-ის მეშვეობით რაიმე სიმბოლო რომლითაც შემდეგ გააერთიანებთ სიაში მოცემულ სიტყვებს.



# 1
sentence = input("შეიყვანეთ წინადადება: ")
words = sentence.split(' ')
print("დაშლილი სიტყვები: ", words)



# 2

my_list = ['hi', 'hello', 'group']
separator = input("შეიყვანეთ სიმბოლო, რომლითაც გააერთიანებთ სიტყვებს: ")
joined_string = separator.join(my_list)
print("გაერთიანებული სტრინგი:", joined_string)