# 2) კომენტარებით ახსენით რა არის loop(ციკლი)

# 3) კომენტარებით ახსენით რა არის range ფუნქცია და დეტალურად ისაუბრეთ მასზე(განიხილეთ არგუმენტების გადაცემის ყველა ვარიანტი)

# 4) დაბეჭდეთ 100-დან 200-ის ჩათვლით ყველა რიცხვი

# 5) დაბეჭდეთ 20-დან 30-მდე ყოველი მესამე რიცხვი

# 6) დაბეჭდეთ 0-დან 20-ის ჩათვლით ყველა ლუწი რიცხვი

# 7) for ციკლის გამოყენებით მომხმარებელს შემოატანინეთ 5 რიცხვი და საბოლოოდ დაბეჭდეთ მათი საშუალო არითმეტიკული






# foor ციკლის დახმარებით ჩვენ შეგვიძლია ერთი და იგივე კოდის რამდენჯერმე დაბეჭდვა 

#range ფუნქცია გამოყენებით ჩვენ შეგვიძლია წარმოვადგინოთ რიცხვების რიგის იგი იწყება სხვა მნიშვნელობით და მთავრდება სხვა მნიშვნელობით ასვე range ფუნქციას აქვს 3 ძირითადი არგუმენტი

#start , stop , step:  start - პირველი რიცხვი, რომლითაც დაიწყება;  stop - ბოლო რიცხვი, რომლითაც დამთვრდება მარა ეს რიიცხვი არ შედის ამ რიგში; step განსახზღვრავს რამდენი ნაბიჯი უნდა იყოს რიცხვებს შორის დაშორება 

#4
for i in range(100, 201):
    print(i)

#5
for i in range(20, 30, 3):
    print(i)

#6
for i in range(0, 21, 2):
    print(i)

#7
total = 0   # ჯამი

for i in range(5):
    num = float(input("Enter The Num: "))
    total += num

average = total / 5
print(average)
