# 2) ფუნქცია —აქვს სახელი
# და რომელიც ასრულებს გარკვეულ მოქმედებას.
# ყველა ფუნქციას გააჩნია ფრჩხილები რომელშიც გადავცემთ არგუმენტს



# 3) print() არის ჩაშენებული (built-in) ფუნქცია Python-ში.
# ის გამოიყენება ეკრანზე ინფორმაციის გამოსატანად.
# print() ფუნქცია არაფერს აბრუნებს, მისი დანიშნულება მხოლოდ ტერმინალში გამოტანა.


# 4) არგუმენტები არის ის მნიშვნელობები, რომლებსაც ფუნქციას გადავცემთ ფრჩხილებში.მაგალითად: print("Hello") -> "Hello" არის არგუმენტი





# f-string-ის გამოყენებით უფრო დიდი ტექსტი სერიალზე „სამეფო კარის თამაშები“

serial = "სამეფო კარის თამაშები"
world = "ვესტეროსი"
continent = "ესოსი"
houses = "სტარკების, ლანისტერების, ტარგარიენების და ბარათეონების"
throne = "რკინის ტახტი"
themes = "ძალაუფლებისთვის ბრძოლა, ღალატი, ერთგულება, პატივი და გადარჩენა"

text = f"სერიალი {serial} წარმოადგენს დრამას, რომლის მოქმედება ვითარდება კონტინენტებზე {world} და {continent}. სიუჟეტის ცენტრში დგას {houses} საგვარეულოებს შორის დაძაბული ბრძოლა {throne}-ის დასაუფლებლად. თითოეულ ოჯახს აქვს საკუთარი ინტერესები, გეგმები და საიდუმლოებები, რაც ისტორიას კიდევ უფრო საინტერესოს და არაპროგნოზირებადს ხდის. სერიალი გამორჩეულია რთული პერსონაჟებით, მოულოდნელი სიუჟეტური განვითარებით და ღრმა თემებით, როგორიცაა {themes}. სწორედ ეს ელემენტები აქცევს {serial}-ს ერთ-ერთ ყველაზე პოპულარულ და დასამახსოვრებელ სერიალად მსოფლიოში."

print(text)
